bit-finance/DataProcessors/бит_ОтложеннаяТрансляция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ОтложеннаяТрансляция</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийОбработкиОчередиТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыВыполненияОтложеннойТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Comment>Компоновщик</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bit-finance/Enums/бит_СтатусыВыполненияОтложеннойТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СтатусыВыполненияОтложеннойТрансляции</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
					<Comment>Ожидание</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
					<Comment>Выполнено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
					<Comment>Ошибка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/DataProcessors/бит_ОтложеннаяТрансляция/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОтложеннаяТрансляция

Функция НачатьОтложеннуюТрансляцию(ОбъектыВОчереди = Неопределено) Экспорт

	ИдентификаторЗадания = ИдентификаторЗаданияОтложеннаяТрансляция(); 
	ВыполняемыйМетод     = "Обработки.бит_ОтложеннаяТрансляция.ВыполнитьОтложеннуюТрансляцию";
	
	Результат = НовыйРезультатДлительнойОперации();
	
	Если ОжидатьЗавершенияВыполнения(ИдентификаторЗадания) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыВыполнения  = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторЗадания);
	ПараметрыВыполнения.КлючФоновогоЗадания = Строка(ИдентификаторЗадания);
	ПараметрыВыполнения.ОжидатьЗавершение   = Неопределено;
	
	ТранслироватьБезНастроек = Ложь;
	
	Если ОбъектыВОчереди = Неопределено Тогда
		СтатусДляОтбора			 = Перечисления.бит_СтатусыВыполненияОтложеннойТрансляции.Ожидание;
		ОбъектыВОчереди			 = ДанныеДляОбработкиРегламентнымЗаданием(СтатусДляОтбора);
		ТранслироватьБезНастроек = Истина;
	КонецЕсли;
	
	РазмерСписка = ОбъектыВОчереди.Количество();
	
	Если РазмерСписка = 0 Тогда
		Результат.Статус = "Выполнено";                    	
		Возврат Результат;	
	КонецЕсли;            
	
	КоличествоПотоков = ДлительныеОперации.ДопустимоеКоличествоПотоков();
	
	Если КоличествоПотоков = 1 Тогда
		РазмерыПакетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РазмерСписка);
	Иначе	
		Коэффициенты = Новый Массив;
		Для Индекс = 1 По КоличествоПотоков Цикл
			Коэффициенты.Добавить(1);	
		КонецЦикла;
		РазмерыПакетов = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
							РазмерСписка, Коэффициенты, 0);
	КонецЕсли;
	
	// Удалим пакеты нулевой длины.
	Индекс = РазмерыПакетов.ВГраница();
	Пока Индекс >= 0 Цикл
		Если РазмерыПакетов.Получить(Индекс) = 0 Тогда
			РазмерыПакетов.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;

	Пакеты 		 = Новый Массив;
	Счетчик 	 = 0;
	ИндексПакета = 0;
	РазмерПакета = РазмерыПакетов[ИндексПакета];
	ПорцияДанных = ОбъектыВОчереди.СкопироватьКолонки();

	Для каждого СтрокаТаблицы Из ОбъектыВОчереди Цикл
		Если Счетчик = РазмерПакета Тогда
			Пакеты.Добавить(ПорцияДанных);
			
			Счетчик 	 = 0;
			ИндексПакета = ИндексПакета + 1;
			РазмерПакета = ?(РазмерыПакетов.ВГраница() <= ИндексПакета, РазмерыПакетов[ИндексПакета], 0);
			ПорцияДанных = ОбъектыВОчереди.СкопироватьКолонки();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПорцияДанных.Добавить(), СтрокаТаблицы);
		Счетчик	= Счетчик + 1;
	КонецЦикла;
	
	Если ПорцияДанных.Количество() > 0 Тогда
		Пакеты.Добавить(ПорцияДанных);
	КонецЕсли;
	
	НаборПараметровФункции = Новый Соответствие;
	ВерхняяГраницаПакетов  = Пакеты.ВГраница();
	
	Для ИндексПакета = 0 По ВерхняяГраницаПакетов Цикл
		
		ПараметрыФункции  = ПараметрыОтложеннойТрансляции();
		ПараметрыФункции.ДокументыДляОбработки	  = Пакеты[ИндексПакета];
		ПараметрыФункции.ТранслироватьБезНастроек = ТранслироватьБезНастроек;
		
		ТекущиеПараметрыФункции = Новый Массив;
		ТекущиеПараметрыФункции.Добавить(ПараметрыФункции);
		
		НаборПараметровФункции.Вставить(ИндексПакета, ТекущиеПараметрыФункции);
	КонецЦикла;
	
	Возврат ДлительныеОперации.ВыполнитьФункциюВНесколькоПотоков(ВыполняемыйМетод, ПараметрыВыполнения, НаборПараметровФункции);
		
КонецФункции

Функция ВыполнитьОтложеннуюТрансляцию(Параметры) Экспорт
	
	Возврат бит_МеханизмТрансляции.ВыполнитьОтложеннуюТрансляцию(Параметры);
	
КонецФункции

#КонецОбласти

#Область ОтложеннаяОчисткаОчереди

Функция НачатьОтложеннуюОчисткуОчереди() Экспорт

	ИдентификаторЗадания = ИдентификаторЗаданияОтложеннаяОчистка();
    ВыполняемыйМетод     = "Обработки.бит_ОтложеннаяТрансляция.ВыполнитьОтложеннуюОчисткуОчереди";
	
	Результат = НовыйРезультатДлительнойОперации();
	
	Если ОжидатьЗавершенияВыполнения(ИдентификаторЗадания) Тогда
		Возврат Результат;	
	КонецЕсли;   
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторЗадания);
	ПараметрыВыполнения.КлючФоновогоЗадания = Строка(ИдентификаторЗадания);
	ПараметрыВыполнения.ОжидатьЗавершение   = Неопределено;
	
	СтатусДляОтбора = Перечисления.бит_СтатусыВыполненияОтложеннойТрансляции.Выполнено;
	ОбъектыВОчереди = ДанныеДляОбработкиРегламентнымЗаданием(СтатусДляОтбора);
	
	РазмерСписка = ОбъектыВОчереди.Количество();
	
	Если РазмерСписка = 0 Тогда
		Результат.Статус = "Выполнено";                    	
		Возврат Результат;	
	КонецЕсли;
	
	КоличествоПотоков = ДлительныеОперации.ДопустимоеКоличествоПотоков();

	Если КоличествоПотоков = 1 Тогда
		РазмерыПакетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РазмерСписка);
	Иначе	
		Коэффициенты = Новый Массив;
		Для Индекс = 1 По КоличествоПотоков Цикл
			Коэффициенты.Добавить(1);	
		КонецЦикла;
		РазмерыПакетов = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
							РазмерСписка, Коэффициенты, 0);
	КонецЕсли;
	
	// Удалим пакеты нулевой длины.
	Индекс = РазмерыПакетов.ВГраница();
	Пока Индекс >= 0 Цикл
		Если РазмерыПакетов.Получить(Индекс) = 0 Тогда
			РазмерыПакетов.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;

	Пакеты 		 = Новый Массив;
	Счетчик 	 = 0;
	ИндексПакета = 0;
	РазмерПакета = РазмерыПакетов[ИндексПакета];
	ПорцияДанных = ОбъектыВОчереди.СкопироватьКолонки();

	Для каждого СтрокаТаблицы Из ОбъектыВОчереди Цикл
		Если Счетчик = РазмерПакета Тогда
			Пакеты.Добавить(ПорцияДанных);
			
			Счетчик 	 = 0;
			ИндексПакета = ИндексПакета + 1;
			РазмерПакета = ?(РазмерыПакетов.ВГраница() <= ИндексПакета, РазмерыПакетов[ИндексПакета], 0);
			ПорцияДанных = ОбъектыВОчереди.СкопироватьКолонки();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПорцияДанных.Добавить(), СтрокаТаблицы);
		Счетчик	= Счетчик + 1;
	КонецЦикла;
	
	Если ПорцияДанных.Количество() > 0 Тогда
		Пакеты.Добавить(ПорцияДанных);
	КонецЕсли;

	НаборПараметровФункции = Новый Соответствие;
	ВерхняяГраницаПакетов  = Пакеты.ВГраница();
	
	Для ИндексПакета = 0 По ВерхняяГраницаПакетов Цикл
		
		ПараметрыФункции  = ПараметрыОтложеннойОчистки();
		ПараметрыФункции.ДокументыДляОбработки = Пакеты[ИндексПакета];
		
		ТекущиеПараметрыФункции = Новый Массив;
		ТекущиеПараметрыФункции.Добавить(ПараметрыФункции);
		
		НаборПараметровФункции.Вставить(ИндексПакета, ТекущиеПараметрыФункции);
	КонецЦикла;
	
	Возврат ДлительныеОперации.ВыполнитьФункциюВНесколькоПотоков(ВыполняемыйМетод, ПараметрыВыполнения, НаборПараметровФункции);	

КонецФункции

Функция ВыполнитьОтложеннуюОчисткуОчереди(Параметры) Экспорт

	Возврат бит_МеханизмТрансляции.ВыполнитьОтложеннуюОчисткуОчереди(Параметры);
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеСпискаОтложеннойТрансляции

Функция СписокОтложеннойТрансляции(НастройкиКомпоновкиДанных) Экспорт
	
	КоличествоПоказываемыхСобытий = 0;
	
	ПараметрКоличествоСобытий = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(НастройкиКомпоновкиДанных, "КоличествоПоказываемыхСобытий");
	Если ПараметрКоличествоСобытий <> Неопределено Тогда
		КоличествоПоказываемыхСобытий = ПараметрКоличествоСобытий.Значение;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Обработки.бит_ОтложеннаяТрансляция.ПолучитьМакет("СобытияОчередиТрансляции");
	
	Если КоличествоПоказываемыхСобытий <> 0 Тогда
		ТекстЗапроса  = СхемаКомпоновкиДанных.НаборыДанных.Список.Запрос;
		ЧтоЗаменить   = "ВЫБРАТЬ РАЗРЕШЕННЫЕ";
		НаЧтоЗаменить = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ " + Формат(КоличествоПоказываемыхСобытий, "ЧГ=0");
		ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
		СхемаКомпоновкиДанных.НаборыДанных.Список.Запрос = ТекстЗапроса;
	КонецЕсли;
		
	ПараметрыВыполнения = бит_ОтчетыБФСервер.ПараметрыВыгрузитьРезультатСКД();
	ПараметрыВыполнения.СхемаКомпоновки 	= СхемаКомпоновкиДанных;
	ПараметрыВыполнения.НастройкиКомпоновки = НастройкиКомпоновкиДанных; 
	
	Результат = бит_ОтчетыБФСервер.ВыгрузитьРезультатСКД(ПараметрыВыполнения);
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ИзменениеСтатусаЗаписей

Функция ПараметрыОтложеннойУстановкиСтатуса() Экспорт
			
	Возврат бит_МеханизмТрансляции.ПараметрыОтложеннойУстановкиСтатуса();

КонецФункции

Функция ВыполнитьИзменениеСтатусаЗаписей(Параметры) Экспорт

	Возврат бит_МеханизмТрансляции.ВыполнитьИзменениеСтатусаЗаписейОчереди(Параметры);

КонецФункции
	
#КонецОбласти

// Функция инициализирует компоновщик для получения записей 
// регистра сведений бит_ОчередьТрансляции для последующей обработки.
// 
// Параметры:
//  Компоновщик                - КомпоновщикНастроекСхемыКомпоновкиДанных.
//  НастройкиКомпоновкиДанных  - Сохраненые ранее настройки компоновки данных.
// 
// Возвращаемое значение:
//   АдресСхемыКомпоновкиДанных   - Строка.
// 
Процедура ИнициализироватьКомпоновщик(Компоновщик, НастройкиКомпоновкиДанных = Неопределено) Экспорт

	СхемаКомпоновкиДанных = Обработки.бит_ОтложеннаяТрансляция.ПолучитьМакет("СобытияОчередиТрансляции");
	
	Если ТипЗнч(НастройкиКомпоновкиДанных)= Тип("НастройкиКомпоновкиДанных") Тогда
		// Полями выбора пользователь не управляет, но они сохраняются.
		// При изменении полей на стороне поставщика это обеспечивает "правильный" набор.
		НастройкиКомпоновкиДанных.Выбор.Элементы.Очистить();
		ШаблонКоллекции = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Выбор.Элементы;
		Коллекция		= НастройкиКомпоновкиДанных.Выбор.Элементы; 
		Для каждого Элемент Из ШаблонКоллекции Цикл
			НовоеПоле = Коллекция.Добавить(ТипЗнч(Элемент));
			ЗаполнитьЗначенияСвойств(НовоеПоле, Элемент);	
		КонецЦикла;
	КонецЕсли;
	
	бит_ОтчетыБФСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных); 
	
КонецПроцедуры

Процедура ПрименитьНастройки(Настройки, Обработка) Экспорт

	ШаблонНастроек = НовыеСохраняемыеНастройки();

	Если ЗначениеЗаполнено(Настройки) Тогда
		
		РеквизитыНастройки 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Настройки, "ХранилищеНастроек");
		СохраненныеНастройки = РеквизитыНастройки.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ШаблонНастроек, СохраненныеНастройки);
		КонецЕсли;  		
	КонецЕсли;
	
	ИнициализироватьКомпоновщик(Обработка.КомпоновщикНастроек, ШаблонНастроек.НастройкиКомпоновкиДанных);
	
	ЗаполнитьЗначенияСвойств(Обработка, ШаблонНастроек);
	
	Если ШаблонНастроек.ИнтервалДатРегистрации.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		Обработка.ИнтервалДатРегистрации = Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня);
	Иначе	
		Обработка.ИнтервалДатРегистрации = Новый СтандартныйПериод(ШаблонНастроек.ИнтервалДатРегистрации.Вариант);
	КонецЕсли;

	Если ШаблонНастроек.ИнтервалДатСобытий.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		Обработка.ИнтервалДатСобытий = Новый СтандартныйПериод('0001-01-01', '0001-01-01');
	Иначе	
		Обработка.ИнтервалДатСобытий = Новый СтандартныйПериод(ШаблонНастроек.ИнтервалДатСобытий.Вариант);
	КонецЕсли;
	
КонецПроцедуры

Функция НовыеСохраняемыеНастройки() Экспорт

	Настройки = Новый Структура;
	Настройки.Вставить("ИнтервалДатРегистрации", 		Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня));
	Настройки.Вставить("ИнтервалДатСобытий", 			Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод));
	Настройки.Вставить("НастройкиКомпоновкиДанных",		Неопределено);  
	Настройки.Вставить("Статусы",						Новый СписокЗначений);  
	Настройки.Вставить("КоличествоПоказываемыхСобытий", 200);
	
	Возврат Настройки;
	
КонецФункции

Функция НовыеПараметрыОбъекта() Экспорт

	Настройки = Новый Структура;
	Настройки.Вставить("ИнтервалДатРегистрации", 		Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня));
	Настройки.Вставить("ИнтервалДатСобытий", 	 		Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод));
	Настройки.Вставить("КомпоновщикНастроек",	 		Новый КомпоновщикНастроекКомпоновкиДанных);  
	Настройки.Вставить("КоличествоПоказываемыхСобытий", 200);
	Настройки.Вставить("Статус",						Перечисления.бит_СтатусыВыполненияОтложеннойТрансляции.ПустаяСсылка());  
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыОтложеннойТрансляции() 
	
	Возврат бит_МеханизмТрансляции.ПараметрыОтложеннойТрансляции();
	
КонецФункции

Функция ПараметрыОтложеннойОчистки()
		
	Возврат бит_МеханизмТрансляции.ПараметрыОтложеннойОчистки();

КонецФункции

Функция ДанныеДляОбработкиРегламентнымЗаданием(СтатусДляОтбора)
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	ИнициализироватьКомпоновщик(Компоновщик);
	НастроитьКомпоновщикДляРегламентногоЗадания(Компоновщик, СтатусДляОтбора);
	
	Результат = СписокОтложеннойТрансляции(Компоновщик.ПолучитьНастройки());
	
	Возврат Результат;
	
КонецФункции

Процедура НастроитьКомпоновщикДляРегламентногоЗадания(Компоновщик, СтатусДляОтбора)
	
	Если СтатусДляОтбора = Перечисления.бит_СтатусыВыполненияОтложеннойТрансляции.Выполнено Тогда
		
		// Очистка очереди.
		ПравоеЗначение = Новый Массив;		
		ПравоеЗначение.Добавить(Перечисления.бит_СтатусыВыполненияОтложеннойТрансляции.Выполнено);
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(Компоновщик.Настройки, "Статусы", ПравоеЗначение);
		
		Компоновщик.Настройки.Структура.Очистить();
		Группировка = бит_ОтчетыБФКлиентСервер.ДобавитьГруппировкуВКореньСтруктуры(Компоновщик, "Объект");
		бит_ОтчетыБФСервер.НовоеПолеГруппировки(Группировка, "Статус");
		
	ИначеЕсли СтатусДляОтбора = Перечисления.бит_СтатусыВыполненияОтложеннойТрансляции.Ожидание Тогда
		
		// Трансляция.
		ПравоеЗначение = Новый Массив;
		ПравоеЗначение.Добавить(Перечисления.бит_СтатусыВыполненияОтложеннойТрансляции.Ожидание);
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(Компоновщик.Настройки, "Статусы", ПравоеЗначение);
		
		Компоновщик.Настройки.Структура.Очистить();
		бит_ОтчетыБФКлиентСервер.ДобавитьГруппировкуВКореньСтруктуры(Компоновщик, "Объект");
		
	КонецЕсли;

КонецПроцедуры

Функция ОжидатьЗавершенияВыполнения(ИдентификаторЗадания)
	
	ОжидатьЗавершения = Ложь;
	Задание			  = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	
	Если Задание <> Неопределено Тогда
		Задание = Задание.ОжидатьЗавершенияВыполнения(1);
		ОжидатьЗавершения = (Задание.Состояние = СостояниеФоновогоЗадания.Активно);
	КонецЕсли;
	
	Возврат ОжидатьЗавершения;
	
КонецФункции

Функция ИдентификаторЗаданияОтложеннаяТрансляция() Экспорт

	 ИдентификаторЗадания = Новый УникальныйИдентификатор("b4e07e65-9351-4dd3-97b3-1813feedea72"); 
	 
     Возврат ИдентификаторЗадания;
	 
КонецФункции

Функция ИдентификаторЗаданияОтложеннаяОчистка() Экспорт

	 ИдентификаторЗадания = Новый УникальныйИдентификатор("c6093d6e-1c81-43a3-a98f-9e6aeb472be4"); 
	 
     Возврат ИдентификаторЗадания;
	 
КонецФункции

// Конструктор, повторяющий результат функции ДлительныеОперации.ВыполнитьФункциюВНесколькоПотоков()
// 
Функция НовыйРезультатДлительнойОперации()
	
	Результат = Новый Структура; 
	Результат.Вставить("АдресРезультата", 				"");
	Результат.Вставить("ИдентификаторЗадания", 		Новый УникальныйИдентификатор());
	Результат.Вставить("КраткоеПредставлениеОшибки", 	"");
	Результат.Вставить("ПодробноеПредставлениеОшибки", "");
	Результат.Вставить("Сообщения", 					Новый Массив);
	Результат.Вставить("Статус", 						"Выполняется");
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
